---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnAndTargetAreConcrete
source: html/2c60a2bb-586a-d99d-6de0-1ae096a5721d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnAndTargetAreConcrete Property

Column and target are both concrete. Geometries have been joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnAndTargetAreConcrete { get; }
```